{
  "backend/main.mo": "Defines core actor logic for patient, doctor, and family data management, including profiles, vitals, medications, appointments, alerts, and authorization helpers.",
  "feature_evidence.json": "Contains feature evidence metadata linking implemented features to source files, components, and test requirements.",
  "frontend-file-summaries.txt": "Provides short descriptions of several frontend files for reference and documentation.",
  "frontend/index.css": "Sets Tailwind base styles and design tokens, including color themes, dark mode variables, and alert-state colors.",
  "frontend/index.html": "Defines the HTML shell with a root mount point and loads the main frontend script.",
  "frontend/src/App.tsx": "Configures TanStack Router, authentication gating, role-based routing, and global layout setup.",
  "frontend/src/components/app/AppHeader.tsx": "Renders the top navigation bar with user menu, logout, role-aware navigation, and health chat access.",
  "frontend/src/components/appointments/AppointmentsPanel.tsx": "Lists, creates, and deletes patient appointments with a form dialog and table view.",
  "frontend/src/components/medications/MedicationRemindersPanel.tsx": "Manages medication reminders including adding new reminders and deleting existing ones.",
  "frontend/src/components/patient/ConnectedDevicesEditor.tsx": "Allows adding and removing connected device names for a patient profile.",
  "frontend/src/components/patient/FamilyAccessManager.tsx": "Displays family members with access and supports granting or revoking access using principals.",
  "frontend/src/components/patient/HomeNurseBookingForm.tsx": "Form for submitting home nurse visit requests with date, time, and details.",
  "frontend/src/components/patient/PatientProfileCard.tsx": "Loads, displays, and edits patient profile details including medical history and connected devices.",
  "frontend/src/components/patient/SOSButton.tsx": "Provides an SOS alert button that sends an emergency notification after user confirmation.",
  "frontend/src/components/theme/AlertStyles.tsx": "Exports CSS class mappings for alert severity levels and a helper to retrieve them.",
  "frontend/src/components/vitals/VitalsEntryForm.tsx": "Form component that captures vitals inputs and submits them via addVitals mutation, then resets fields and shows toast notifications.",
  "frontend/src/components/vitals/VitalsList.tsx": "Displays a sortable table of vitals readings with status badges and formatted timestamps.",
  "frontend/src/content/healthFaq.ts": "Defines FAQ entries with keyword matching and corresponding health guidance answers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current caller’s user profile using the active actor, handling loading state based on identity readiness.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on profiles, vitals, medications, appointments, and alerts via the backend actor.",
  "frontend/src/hooks/useRoleRouting.ts": "Maps user roles to their corresponding route paths.",
  "frontend/src/index.css": "Re-exports root stylesheet.",
  "frontend/src/lib/chatbot.ts": "Matches user questions to FAQ entries by keyword and returns the associated answer or a fallback.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/doctor/DoctorDashboard.tsx": "Displays a doctor's overview of patients and alerts with counts and sorted alert data. Includes navigation and visual summaries for patient management.",
  "frontend/src/pages/doctor/PatientDetail.tsx": "Shows detailed patient information including vitals, alerts, medications, appointments, and nurse requests. Fetches multiple data sources and presents them in tabbed sections.",
  "frontend/src/pages/family/FamilyDashboard.tsx": "Provides a family member’s dashboard showing the assigned patient’s basic details. Allows navigation to the patient's health status view if access is granted.",
  "frontend/src/pages/family/FamilyPatientStatus.tsx": "Displays a read-only family view of a patient’s profile, vitals, alerts, medications, and appointments with sorting and alert styling.",
  "frontend/src/pages/HealthChat.tsx": "Implements a simple health Q&A chatbot UI with message history, input handling, and safety disclaimer. Uses matchQuestion to generate responses and displays messages in a scrollable chat layout.",
  "frontend/src/pages/LandingLogin.tsx": "Provides the landing and login page with marketing content and Internet Identity login handling. Shows feature highlights and manages re-authentication edge cases.",
  "frontend/src/pages/OnboardingRole.tsx": "Handles user onboarding by collecting name and role, validating inputs, and saving the profile. Redirects users based on role and supports family member patient linking.",
  "frontend/src/pages/patient/PatientDashboard.tsx": "Renders the patient dashboard with profile info, vitals entry, medication reminders, appointments, family access, SOS button, and nurse booking tabs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Project state metadata describing app purpose, features, requirements, issues, and image asset needs."
}